#include <Windows.h>
#include <stdio.h>

void main() {
	// 1001 // 70, 60
	// 1002 // 50, 30, 20
	// 1003 // 30
	// 1004 // 만개

	int arr[4][10000] = { 0 };

	int** pp = 0;
	int count = 4;

	pp = new int*[count];		// pp = (int**)malloc(sizeof(int*)*count);
								// new 키워드로 객체 새로 파주기
								// 이중포인터랑 같은 소리인가봄
								// (int*) 단일포인터 변수를 count 만큼 배열로 가지고 있는상태
	pp[0] = new int[2];
	pp[0][0] = 70;
	pp[0][1] = 60;

	// ------------------------------------

	pp[1] = new int[3];
	pp[1][0] = 50;
	pp[1][1] = 30;
	pp[1][2] = 20;

	// ------------------------------------

	pp[2] = new int[1];
	pp[2][0] = 30;

	// ------------------------------------
	pp[3] = new int[10001];

	system("pause");
	// 포인터 그림 모두 그렸음
}